notes/emacs/space_chinese_font.org
#+title: spacemacs 中文字体配置

* spacemacs 默认英文字体配置
在 init.el 中大约 170 行左右的位置，有配置代码:
#+BEGIN_SRC lisp
   dotspacemacs-default-font '("Source Code Pro"
                               :size 12
                               :weight normal
                               :Height normal
                               :powerline-scale 1.1)
#+END_SRC
这里配置了 spacemacs 的基本字体。这个配置信息似乎会在 spacemacs 启动完成后再次被执行，导致在 user-config 中的配置无效，所以在这里需要配置 spacemacs 的基本英文字体。

* 中文字体配置
chinese layer 中，定义了 spacemacs//set-monospaced-font 方法，这个方法可以用来配置英文和中文字体，其使用了 emacs 的基本字体配置语法。但是我没有使用这个方法，因为我这里只配置字体，不配置字体的 size，配置方法： 在 init.el 的 dotspacemacs/user-config 方法内，添加中文字体代码：
#+BEGIN_SRC lisp
  (dolist (charset '(kana han cjk-misc bopomofo))
    (set-fontset-font (frame-parameter nil 'font) charset
                      (font-spec :family "思源黑体 CN")))
#+END_SRC

* 中英文字体对齐问题
上边的配置由于没有配置中文字体的 size，中文字体使用了英文字体一样的 size，导致中文字体和英文字体对不齐的问题，在 org table，mu4e 等模式下尤其明显。所以，还需要在 init.el 的 dotspacemacs/user-config 中配置中文字体缩放：
#+BEGIN_SRC lisp

  (setq face-font-rescale-alist '(("宋体" . 1.2)
                                  ("微软雅黑" . 1.2)
                                  ("思源黑体 CN" . 1.2)
                                  ("WenQuanYi Zen Hei" . 1.2)))
#+END_SRC

这样就可以保持 2 个英文字母等于一个汉字大小。

参考资料：
[[https://archive.casouri.cat/note/2019/emacs-%25E5%25AD%2597%25E4%25BD%2593%25E4%25B8%258E%25E5%25AD%2597%25E4%25BD%2593%25E9%259B%2586/][Emacs，字体与字符集]]
[[http://baohaojun.github.io/perfect-emacs-chinese-font.html][狠狠地折腾了一把 Emacs 中文字体]]
